I have the same problem. I created a GCP Discovery Engine Data store manually by using the UI ([AI Apps -> Data stores](https://console.cloud.google.com/gen-app-builder/data-stores)). I entered the following values:

- Source:
  - Cloud Storage
- Data:
  - Structured data import: CSV (for FAQ data)
  - Synchronisation frequency: One time
  - File to import: `gs://MYPROJECT-files/my-data.csv`
- Configuration:
  - Location: global
  - Name: `my-ds-manual`
- Billing:
  - Pricing model: General pricing

Then I wrote a corresponding tf object:
```tf
resource "google_discovery_engine_data_store" "my-ds-manual" {
  location                     = "global"
  data_store_id                = "my-ds-manual"
  display_name                 = "my-ds-manual"
  industry_vertical            = "GENERIC"
  // content_config is mandatory: ["NO_CONTENT" "CONTENT_REQUIRED" "PUBLIC_WEBSITE"]
  content_config               = "CONTENT_REQUIRED"
  solution_types               = ["SOLUTION_TYPE_SEARCH"]
  create_advanced_site_search  = false
  skip_default_schema_creation = false

  document_processing_config {
    default_parsing_config  {
      digital_parsing_config {}
    }
  }
}
```

I then imported it.

```tf
import {
  to = google_discovery_engine_data_store.my-ds-manual
  id = "${var.project_id}/global/my-ds-manual"
}
```

On running `terraform plan`, I get the dreaded **forces replacement** because of `content_config`:

```
  # google_discovery_engine_data_store.my-ds-manual must be replaced
  # (imported from "MYPROJECT/global/my-ds-manual")
  # Warning: this will destroy the imported resource
-/+ resource "google_discovery_engine_data_store" "my-ds-manual" {
      + content_config               = "CONTENT_REQUIRED" # forces replacement
      + create_advanced_site_search  = false
      ~ create_time                  = "2026-01-10T14:20:44.800247Z" -> (known after apply)
        data_store_id                = "my-ds-manual"
      ~ default_schema_id            = "default_schema" -> (known after apply)
        display_name                 = "my-ds-manual"
      ~ id                           = "projects/MYPROJECT/locations/global/collections/default_collection/dataStores/my-ds-manual" -> (known after apply)
        industry_vertical            = "GENERIC"
        location                     = "global"
      ~ name                         = "projects/999888777666/locations/global/collections/default_collection/dataStores/my-ds-manual" -> (known after apply)
        project                      = "MYPROJECT"
      + skip_default_schema_creation = false
        solution_types               = ["SOLUTION_TYPE_SEARCH"]

      ~ advanced_site_search_config (known after apply)

      ~ document_processing_config {
          ~ name = "projects/999888777666/locations/global/collections/default_collection/dataStores/my-ds-manual/documentProcessingConfig" -> (known after apply)

            default_parsing_config {
                digital_parsing_config {}
            }
        }
    }

Plan: 1 to import, 1 to add, 0 to change, 1 to destroy.
```

## Versions

- Terraform: v1.14.3 on linux_amd64 - the latest as of today (ref doc: [Install Terraform](https://developer.hashicorp.com/terraform/install))
- provider registry.terraform.io/hashicorp/google: v7.15.0 - the latest as of today (ref doc: [Terraform provider for Google Cloud](https://registry.terraform.io/providers/hashicorp/google/latest/docs))